package main

import (
	"fmt"
	"./ProCon2018"
)

func main() {
	/* JSON組立 ----------------------------------------------------------------------------------------------------- */
	field := ProCon2018.Field {
		Scores: []int{1, 1, 2, 3, 5, 8, 13},
		Height: 10,
		Width: 20,
	}

	// tilesで指定するy, xは 0-index です。<-？
	tile := ProCon2018.Tile {
		Y: 32,
		X: 64,
	}
	
	team := ProCon2018.Team {
		TilesA: []ProCon2018.Tile{tile, tile},
		TilesB: []ProCon2018.Tile{tile, tile},
	}

	status := ProCon2018.Status {
		Field: field,
		Teams: []ProCon2018.Team{team, team},
	}

	// おためしJSON変換
	str, err := ProCon2018.GetJSONString(status, true)
	if err != nil {
		fmt.Println("json化エラー")
		return
	}
	fmt.Println(str) // おみせいたす
	/* ---------------------------------------------------------------------------------------------------------------- */
	
	/* POSTリクエスト ---------------------------------------------------------------------------------------------- */
	ProCon2018.GetResponse(status);
	/* ---------------------------------------------------------------------------------------------------------------- */

	/* レスポンス解析 ----------------------------------------------------------------------------------------------- */
	/* ---------------------------------------------------------------------------------------------------------------- */
}

